app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "created_at", "title", "updated_at", "content") VALUES('First Post', '2009-12-01 02:34:49', 'Life is Good', '2009-12-01 02:34:49', 'OK, so this is a dummy blog application for Rails based on the RoR guide.')

    def find_post
      @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)